#+TITLE: Coding the Crack Interview
#+author: Logan Rios

Notes and interview questions from the (in)famous CTCI! Note that everything here is done in a literate style. Run =C-c C-v t= to tangle out to individual problem files.

* :toc:
- [[#introduction][Introduction]]
- [[#arrays-and-strings][Arrays and Strings]]
  - [[#hash-tables][Hash Tables]]
  - [[#stringbuilder][StringBuilder]]
  - [[#interview-questions][Interview Questions]]
- [[#appendix-helpers][Appendix: Helpers]]

* Introduction
#+begin_quote
Given an array of distinct integer values, count the number of pairs of integers that have difference ~k~. For example, given the array ~{1, 7, 5, 9, 2, 12, 3}~ and the difference ~k = 2~, there are four pairs with difference 2: ~(1 3) (3 5) (5 7) (7 9)~.
#+end_quote

We /could/ start with a brute force algorithm, starting from the first element, and then search through the remaining elements. For each pair, compute the difference. If the difference equals ~k~, increment a counter of the difference.

#+begin_src python
results = 0
for i in range(n):
    for j in range(n):
        if a[i] - a[j] == k:
            results += 1
return results
#+end_src

However, the performance is inherently O(N^2) here, which is no good. What's out bottleneck? The search for the "other side" of the pair.

The other side is always =x - k= or =x + k=. If we sorted the array, we could find the other side for each of the N elements in O(log N) time by doing a binary search. We now have a two-step algorithm, where both steps take O(N log N) time. Now, sorting is the new bottleneck. Optimizing the second step won't help because the first step is slowing us down, anyway.

We can just get rid of the first step entirely and operate on an unsorted array. How can we find things quickly in an unsorted array? With a hash table!

Throw everything in the array into the hash table. Then, to look up if =x-k= or =x+k= exist in the array, we just look it up in the has table. We can do this in O(N) time.

In general, you cannot search an array in better than O(log N) time.
Throw everything in B into a hash table. Any precomputation that's O(N) or less is 'free'.

Most questions will take about 20 to 30 minutes to solve, provided you're a 'strong' candidate.

* Arrays and Strings
** Hash Tables
An ArrayList in Java is an array-like data structure that offers dynamic resizing, but still provides O(1) access (unlike Linked Lists).

#+begin_src java
ArrayList<String> merge(String[] words, String[] more) {
    ArrayList<String> sentence = new ArrayList<String>();
    for (String w : words) sentence.add(w);
    for (String w : more) sentence.add(w);
    return sentence;
}
#+end_src

An essential data structure for interviews. Make sure you're comfortable with the dynamically resizable version of an array in whatever language you're working with. Note the name of the data structure as well as the "resizing factor" (which happens to be 2 in Java, but can vary).

** StringBuilder
Suppose you are concatenating a list of strings, as shown below. What would the runtime of this code be? Assume that all strings are the same length =x=, and that there are =n= strings.

#+begin_src java
String joinWords(String[] words) {
    String sentence = "";
    for (String w : words) {
        sentence = sentence + w;
    }
    return sentence;
}
#+end_src

This reduces to =O(xn^2)=. On each concatenation, a new String is created, and the two strings are copied over, character by character. The second iteration requires copying 2x characters. The third iteration requires 3x, and so on. The total time therefore is =O(x+2x+...+nx)=.

StringBuilder, on the other hand, creates a resizable array of all the strings, and copies them back to a string only when necessary.

#+begin_src java
String joinWords(String[] words) {
    StringBuilder sentence = new StringBuilder();
    for (String w : words)
        sentence.append(w);
    return sentence.toString();
}
#+end_src

A good exercise to practice strings, arrays, and general data structures is to implement your own version of StringBuilder, HashTable, and ArrayList.

** Interview Questions
*** Is Unique
Implement an algorithm to determine if a string has all-unique characters. What if you cannot use additional data structures?

#+begin_src java :tangle IsUnique.java
import java.util.*;

public class IsUnique {
    public static boolean IsUnique(String s) {
        HashMap<Character, Boolean> chars = new HashMap<>();
        for (int i = 0; i < s.length(); i++) {
            Character c = s.charAt(i);
            if (chars.containsKey(c)) return false;
            chars.put(c, true); // technically value doesn't matter??
        }
        return true;
    }

    public static void main(String[] args) {
        System.out.println(IsUnique("aaaa"));
        System.out.println(IsUnique("aaab"));
        System.out.println(IsUnique("dbad"));
        System.out.println(IsUnique("abcd"));
        System.out.println(IsUnique("abcdefghijklmnop"));
    }
}
#+end_src

#+RESULTS:
: false
: false
: false
: true
: true

As far as not using additional data structures... that's a toughie. The HashMap doesn't really need the boolean field; we don't use it. The question is more WHY.

TODO come back to me

Lessons learned:
+ ~String.length()~ is a method
+ ~HashMap.containsKey()~

*** Check Permutations
Given two strings, write a method to decide if one is a permutation of the other.

#+begin_src java :tangle CheckPermutations.java
import java.util.*;

public class CheckPermutations {
    public static boolean IsPermutation(String a, String b) {
        int alen = a.length();
        int blen = b.length();
        if (alen != blen) return false;

        HashMap<Character, Integer> achars = new HashMap<>();
        for (int i = 0; i < alen; i++) {
            Character c = a.charAt(i);
            if (achars.containsKey(c)) {
                achars.put(c, achars.get(c) + 1);
                continue;
            }
            // c is new to the map
            achars.put(c, 1);
        }

        for (int i = 0; i < blen; i++) {
            Character c = b.charAt(i);
            if (!(achars.containsKey(c)))
                return false;

            int count = achars.get(c);
            if (count == 0) return false;
            achars.put(c, count - 1);
        }

        return true;
    }

    public static void main(String[] args) {
        // true cases
        System.out.println(IsPermutation("aba", "aab"));
        System.out.println(IsPermutation("abc", "cba"));
        System.out.println(IsPermutation("aba", "aab"));

        // false cases
        System.out.println(IsPermutation("abd", "ddd"));
        System.out.println(IsPermutation("xxx", "abc"));
        System.out.println(IsPermutation("xyz", "zyyyx"));
    }
}
#+end_src

#+RESULTS:
: true
: true
: true
: false
: false
: false

I'm thinking a HashMap of all the characters correlated with their indices is the easiest thing we can do here. Take the first string (or the second, technically it doesn't matter) and slice it into a hashmap. Then, iterate through the second string until we figure it out. Obviously there are some shortcuts we can take--if they don't have a matching length, for example, we can throw them out right away.

Lessons Learned:
+ Stop trying to get cute with implied types. It doesn't work here.

Done!

*** URL-ify
Write a method to replace all spaces in a string with =%20=. You may assume that the string has sufficient space at the end to hold the additional characters, and that you are given the "true" length of the string. If you are implementing in Java, please use a character array so that you can perform this operation in place.

#+begin_src java :tangle Urlify.java
import java.util.*;

public class Urlify {
    public static char[] Urlify(char[] ca, int len) {
        for (int i = 0; i < len; i++) {
            char c = ca[i];
            if (c != ' ') continue;
            // First, shift all the characters after this one down three
            // We can use ca.length because we know we have enoug space
            for (int j = ca.length - 3; j > i; j--) {
                ca[j + 2] = ca[j];
            }
            // This is the last step
            ca[i] = '%';
            ca[i+1] = '2';
            ca[i+2] = '0';
            i += 2;
        }
        return ca;
    }

    public static void main(String[] args) {
        System.out.println(Urlify("Mr John Smith      ".toCharArray(), 13));
        System.out.println(Urlify("Monsieur Hibidad  ".toCharArray(), 16));
    }
}
#+end_src

#+RESULTS:
: Mr%20John%20Smith
: Monsieur%20Hibidad

I am a little confused by this need to work inside a character array. So, the output string should be a character array itself? Or, I suppose I can just initialize a new character array. That makes more sense.

Performing the operation in place is ridiculous. Oh--presume that you have enough space to move all the extra characters, of course. That means that we don't have to dynamically resize, and we can just perform the operation in place...?

So the parameter we are given for "true size" is just how many characters before the end we have to go--unfortunately, it says nothing about our character array. No way to break this into a binary search, so that means we have to have at least O(N) time. We can't use the =StringBuiler=, so that limits our options...

The problem is that we have to do it in place! So how do /I/ know when it's over... oh. It's obvious. Our writing index and our character index do not necessarily have to be the same.

So I'm iterating through the array to figure out when I don't have to iterate through the array a second time. That seems... inefficient. Work backwards through the array to shift it over. Start at ~length - 2~ because we are now going to disregard the last two characters, and just blindly overwrite them.

Lessons Learned:
+ The ~String.toCharArray()~ method.
+ Primitive arrays have a ~arr.length~ as a /property/, not a function.

This one was quite difficult--especially figuring out how exactly to manipulate the indices to do it in-place. I could easily decrease this from O(N^2) time, provided I could increase the space requirements (and actually utilize, I don't know, a StringBuilder or a dynamic array).

*** Palindrome Permutation
Given a string, write a function to check if it is a permutation of a palindrome. A palindrome is a word or phrase that is the same forwards and backwards. A permutation is a rearrangement of letters. The palindrome does not need to be limited to just dictionary words.

#+begin_src java :tangle PalindromePermutation.java

#+end_src

* Appendix: Helpers

Some boilerplate that'll help us deal with everything going on here.

#+begin_src makefile :tangle makefile
.PHONY: clean

clean:
	rm -f *.class *.java makefile
#+end_src

#+begin_src sh
make clean
#+end_src

#+RESULTS:
: rm -f *.class
